export const navigationNodes = {

/////Біля  головного входу/////
    main_entrance: [8.5, 0.1, 8.5],
    corridor_main_entrance_hub: [10.5, 0.1, 8.5],
    museum: [9.5, 0.1, 14],
    rector: [9.5, 0.1, 12.6],
    rectorsroom: [9.5, 0.1, 11],
    prorector: [9.4, 0.1, 10],
    assistantrector: [9, 0.1, 9.3],
    atc: [9, 0.1, 8.2],
    ViceRectorResearch: [9.5, 0.1, 7.8],
    academiccouncil: [9.5, 0.1, 6.3],

    corridor_main_14_0: [10.5, 0.1, 14.0],  // Навпроти Музею
    corridor_main_12_6: [10.5, 0.1, 12.6],  // Навпроти Ректора
    corridor_main_11_0: [10.5, 0.1, 11.0],  // Навпроти Приймальні
    corridor_main_10_0: [10.5, 0.1, 10.0],  // Навпроти Проректора
    corridor_main_9_3:  [10.5, 0.1, 9.3],   // Навпроти Асистента ректора
    corridor_main_8_2:  [10.5, 0.1, 8.2],   // Навпроти АТС
    corridor_main_7_8:  [10.5, 0.1, 7.8],   // Навпроти Проректора з навк. роботи
    corridor_main_6_3:  [10.5, 0.1, 6.3] ,   // Навпроти Вченої ради

/////Біля  кафе//////
    cafe: [6, 0.1, 5.2],
    a17: [8, 0.1, 4],
    a16: [9, 0.1, 4],
    a15: [10.5, 0.1, 4],

   corridor_hub_6_0: [6, 0.1, 5.2],
    corridor_hub_8_0: [8, 0.1, 5.2],
    corridor_hub_9_0: [9, 0.1, 5.2],
    corridor_hub_10_5: [10.5, 0.1, 5.2],

    side_entrance_1: [10.5, 0.1, 2.5],

    p5: [13, 0.1, 5.3],
    a8a: [14, 0.1, 3.1],
    a8: [14, 0.1, 2.6],

    corridor_main_p5: [11.2, 0.1, 5.3],  //навпроти П5
    corridor_a8_top: [11.2, 0.1, 2.5],   //навпроти а8
    corridor_a8_mid: [11.2, 0.1, 3.1],   //навпроти а8а
    corridor_a8_exit: [11.2, 0.1, 5.3],

//////Великий  каридор  біля  входу  4, 5 //////
    side_entrance_4: [13.2, 0.1, -16.7], // Вхід №5 (Старомонастирський)
    side_entrance_5: [9.4, 0.1, -18.7],  // Вхід №6 (З боку гуртожитків)
    c_long_m16_5_hub: [11.25, 0.1, -16.5],

    kKryvytska: [10, 0.1, 0.1],
    a3: [10, 0.1, -2.2],
    a4: [10, 0.1, -4],
    dekan_economic: [10, 0.1, -5],
    dekanat_economic: [10, 0.1, -5.7],
    a5: [10, 0.1, -7.1],
    p1: [10, 0.1, -10],
    a57: [10, 0.1, -14.5],
    a56: [10, 0.1, -15.3],
    a55: [10, 0.1, -16.3],
    a54: [10, 0.1, -17.1],
    a53: [10, 0.1, -18],
    a51: [10, 0.1, -20.6],
    a50: [10, 0.1, -21.5],
    a2: [12.5, 0.1, 1.1],
    a1: [12.5, 0.1, -1.1],
    informdepartment: [12.5, 0.1, -2.5],
    cybernetics: [12.5, 0.1, -4.6],
    drgm: [12.5, 0.1, -5.4],
    dekanrgm: [12.5, 0.1, -6.1],
    p2: [12.5, 0.1, -8],
    kIEI: [12.5, 0.1, -12],
    clerk: [12.5, 0.1, -13.5],
    studentdepartment: [12.5, 0.1, -14.5],
    vivat: [12.5, 0.1, -17.9],
    a46: [12.5, 0.1, -18.8],
    a47: [12.5, 0.1, -19.7],
    a48: [12.5, 0.1, -20.6],
    a49: [12.5, 0.1, -21.5],


    c_long_p1_1:   [11.25, 0.1, 1.1],   // Навпроти a2
    c_long_0_1:    [11.25, 0.1, 0.1],   // Навпроти kKryvytska
    c_long_m1_1:   [11.25, 0.1, -1.1],  // Навпроти a1
    c_long_m2_2:   [11.25, 0.1, -2.2],  // Навпроти a3
    c_long_m2_5:   [11.25, 0.1, -2.5],  // Навпроти informdepartment
    c_long_m4_0:   [11.25, 0.1, -4.0],  // Навпроти a4
    c_long_m4_6:   [11.25, 0.1, -4.6],  // Навпроти cybernetics
    c_long_m5_0:   [11.25, 0.1, -5.0],  // Навпроти dekan_economic
    c_long_m5_4:   [11.25, 0.1, -5.4],  // Навпроти drgm
    c_long_m5_7:   [11.25, 0.1, -5.7],  // Навпроти dekanat_economic
    c_long_m6_1:   [11.25, 0.1, -6.1],  // Навпроти dekanrgm
    c_long_m7_1:   [11.25, 0.1, -7.1],  // Навпроти a5
    c_long_m8_0:   [11.25, 0.1, -8.0],  // Навпроти П2
    c_long_m10_0:  [11.25, 0.1, -10.0], // Навпроти П1
    c_long_m12_0:  [11.25, 0.1, -12.0], // Навпроти kIEI
    c_long_m13_5:  [11.25, 0.1, -13.5], // Навпроти clerk
    c_long_m14_5:  [11.25, 0.1, -14.5], // Навпроти a57 та studentdepartment
    c_long_m15_3:  [11.25, 0.1, -15.3], // Навпроти a56
    c_long_m16_3:  [11.25, 0.1, -16.3], // Навпроти a55
    c_long_m17_1:  [11.25, 0.1, -17.1], // Навпроти a54
    c_long_m17_9:  [11.25, 0.1, -17.9], // Навпроти vivat
    c_long_m18_0:  [11.25, 0.1, -18.0], // Навпроти a53
    c_long_m18_8:  [11.25, 0.1, -18.8], // Навпроти a46
    c_long_m19_7:  [11.25, 0.1, -19.7], // Навпроти a47
    c_long_m20_6:  [11.25, 0.1, -20.6], // Навпроти a51 та a48
    c_long_m21_5:  [11.25, 0.1, -21.5] , // Навпроти a50 та a49

/////Частина біля входу 3 /////
    infotechnologycenter: [3, 0.1, 3.5],
    a24: [0.6, 0.1, 5.5],
    a25: [-1.1, 0.1, 5.5],
    side_entrance_2: [2, 0.1, 6],    // Вхід №3

    corridor_hub_3_0: [3, 0.1, 4.5],   // Навпроти ІТЦ
    corridor_hub_2_0: [2, 0.1, 4.5],   // Навпроти Входу №3
    corridor_hub_0_6: [0.6, 0.1, 4.5],  // Навпроти дверей а24
    corridor_hub_m1_1: [-1.1, 0.1, 4.5], // Навпроти дверей а25

////
    a23: [9.2, 0.9, 13.0],
    a22: [9.2, 0.9, 12.0],
    hall: [10.5, 0.9, 9.5],
    a21: [9.2, 0.9, 6.1],

    corridor_main_13_0_2f: [10.5, 0.9, 13.0],
    corridor_main_12_0_2f: [10.5, 0.9, 12.0],
    corridor_main_9_5_2f:  [10.5, 0.9, 9.5],
    corridor_main_6_1_2f:  [10.5, 0.9, 6.1],

    a20: [10.7, 0.9, 4.0],
    a19: [9.5, 0.9, 4.0],
    a18: [8.1, 0.9, 4.0],
    loft: [6.3, 0.9, 4.0],

    corridor_hub_10_7_2f: [10.7, 0.9, 5.2],
    corridor_hub_9_5_2f:  [9.5, 0.9, 5.2],
    corridor_hub_8_1_2f:  [8.1, 0.9, 5.2],
    corridor_hub_6_3_2f:  [6.3, 0.9, 5.2],

    p4: [13.0, 0.9, 5.3],
    a7a: [14.0, 0.9, 3.1],
    a7: [14.0, 0.9, 2.6],

    corridor_main_p4: [11.2, 0.9, 5.3],  // Навпроти П4
    corridor_a7_top: [11.2, 0.9, 2.5],   // Біля сходів та аудиторії а7
    corridor_a7_mid: [11.2, 0.9, 3.1],   // Навпроти а7а
    corridor_a7_exit: [11.2, 0.9, 5.3],   // Вихід

    a6: [12.5, 0.9, 1.0],
    a14: [12.5, 0.9, -1.1],
    a13: [12.5, 0.9, -5.7],
    a63: [12.5, 0.9, -11.0],
    a64: [12.5, 0.9, -13.8],
    a65: [12.5, 0.9, -15.9],
    a67: [12.5, 0.9, -19.2],
    a68: [12.5, 0.9, -20.3],
    a69: [12.5, 0.9, -21.4],
    a70: [10.0, 0.9, -21.4],
    a71: [10.0, 0.9, -20.5],
    a72: [10.0, 0.9, -18.1],
    a73: [10.0, 0.9, -17.1],
    a74: [10.0, 0.9, -15.1],
    a61: [10.0, 0.9, -12.3],
    a62: [10.0, 0.9, -11.0],
    a12: [10.0, 0.9, -7.2],
    a11: [10.0, 0.9, -5.3],
    a10: [10.0, 0.9, -3.5],
    a9:  [10.0, 0.9, -1.7],
    kf:  [10.0, 0.9, 0.2],

    c_long_p1_1_2f:   [11.25, 0.9, 1.1],   // Навпроти a2 та a6
    c_long_0_2_2f:    [11.25, 0.9, 0.2],   // Навпроти kf
    c_long_m1_1_2f:   [11.25, 0.9, -1.1],  // Навпроти a14
    c_long_m1_7_2f:   [11.25, 0.9, -1.7],  // Навпроти a9
    c_long_m3_5_2f:   [11.25, 0.9, -3.5],  // Навпроти a10
    c_long_m5_3_2f:   [11.25, 0.9, -5.3],  // Навпроти a11
    c_long_m5_7_2f:   [11.25, 0.9, -5.7],  // Навпроти a13
    c_long_m7_2_2f:   [11.25, 0.9, -7.2],  // Навпроти a12
    c_long_m11_0_2f:  [11.25, 0.9, -11.0], // Навпроти a63 та a62
    c_long_m12_3_2f:  [11.25, 0.9, -12.3], // Навпроти a61
    c_long_m13_8_2f:  [11.25, 0.9, -13.8], // Навпроти a64
    c_long_m15_1_2f:  [11.25, 0.9, -15.1], // Навпроти a74
    c_long_m15_9_2f:  [11.25, 0.9, -15.9], // Навпроти a65
    c_long_m17_1_2f:  [11.25, 0.9, -17.1], // Навпроти a73
    c_long_m18_0_2f:  [11.25, 0.9, -18.0], // Навпроти vivat та a72
    c_long_m19_2_2f:  [11.25, 0.9, -19.2], // Навпроти a67
    c_long_m20_4_2f:  [11.25, 0.9, -20.4], // Навпроти a68 та a71
    c_long_m21_4_2f:  [11.25, 0.9, -21.4] , // Кінець коридору (навпроти a69 та a70)
    corridor_hub_10_6: [10.9, 0.9, 5.3],

//Сходи
    stairs_1f: [10.5, 0.1, 13.8],
    stairs_2f: [10.5, 0.9, 13.8],

    stairs_z0_1f:    [12.5, 0.1, 0.0],
    stairs_zm7_1f:   [12.5, 0.1, -7.0],
    stairs_zm13_1f:  [10.2, 0.1, -13.5],
    stairs_zm19_1f:  [10.5, 0.1, -19.0],

    stairs_z0_2f:    [12.5, 0.9, 0.0],
    stairs_zm7_2f:   [12.5, 0.9, -7.0],
    stairs_zm13_2f:  [10.2, 0.9, -13.5],
    stairs_zm19_2f:  [10.5, 0.9, -19.0]
};